import { isPointInPolygon } from '@/lib/utils/geo';

export type DeliveryZone = {
    id: number;
    name: string;
    price: number;
    coordinates: number[][][];
    color?: string;
    opacity?: number;
};

export const deliveryZones: DeliveryZone[] = [
    {
        id: 1,
        name: 'Бесплатная доставка',
        price: 0,
        coordinates: [[
            [56.448083, 37.525316],
            [56.403938, 37.488497],
            [56.389160, 37.503898],
            [56.322309, 37.498645],
            [56.330247, 37.544675],
            [56.365411, 37.581519],
            [56.373084, 37.579845],
            [56.385925, 37.568143],
            [56.404277, 37.572474],
            [56.408275, 37.531050],
            [56.447954, 37.525318],
            [56.448083, 37.525316]
        ]],
        color: '#22c55e', // green-500
        opacity: 0.3
    },
    {
        id: 2,
        name: 'Зона 200₽',
        price: 200,
        coordinates: [[
            [56.458630, 37.515494],
            [56.446931, 37.477176],
            [56.374354, 37.405090],
            [56.299450, 37.469689],
            [56.285367, 37.466610],
            [56.281103, 37.475877],
            [56.277785, 37.478084],
            [56.276093, 37.506538],
            [56.266275, 37.584660],
            [56.380167, 37.632883],
            [56.410302, 37.593016],
            [56.418217, 37.561948],
            [56.458601, 37.515380],
            [56.458630, 37.515494]
        ]],
        color: '#3b82f6', // blue-500
        opacity: 0.2
    },
    {
        id: 3,
        name: 'Зона 300₽',
        price: 300,
        coordinates: [[
            [56.550812, 37.635052],
            [56.488691, 37.421440],
            [56.389231, 37.272855],
            [56.229917, 37.491985],
            [56.282713, 37.793475],
            [56.417161, 37.642658],
            [56.489450, 37.681509],
            [56.550928, 37.635116],
            [56.550812, 37.635052]
        ]],
        color: '#a855f7', // purple-500
        opacity: 0.2
    },
    {
        id: 4,
        name: 'Зона 400₽',
        price: 400,
        coordinates: [[
            [56.581765, 37.384760],
            [56.480682, 37.355947],
            [56.411939, 37.234555],
            [56.311687, 37.252218],
            [56.177398, 37.499376],
            [56.304108, 37.955656],
            [56.584128, 37.654163],
            [56.581765, 37.384760]
        ]],
        color: '#f59e0b', // amber-500
        opacity: 0.15
    },
    {
        id: 5,
        name: 'Зона 500₽',
        price: 500,
        coordinates: [[
            [56.781361, 37.513940],
            [56.362147, 37.033288],
            [56.090705, 37.530669],
            [56.310414, 38.048400],
            [56.781361, 37.513940]
        ]],
        color: '#ef4444', // red-500
        opacity: 0.1
    }
];

// Функция определения зоны доставки по координатам
export function checkDeliveryZoneForCoords(coords: number[]) {
    for (let i = 0; i < deliveryZones.length; i++) {
        const zone = deliveryZones[i];
        if (isPointInPolygon(coords, zone.coordinates[0])) {
            return zone;
        }
    }
    return null;
}
